Revit 2024 API
VoltageTypeSet Members
The VoltageTypeSet type exposes the following members.
Constructors
Name | Description
VoltageTypeSet
Initializes a new instance of the VoltageTypeSet class
Methods
Name | Description
Clear
Removes every voltage type from the set, rendering it empty.
Contains
Tests for the existence of a voltage type within the set.
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
Erase
Removes a specified voltage type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Insert
Insert the specified voltage type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
Size
Returns the number of voltage types that are in the set.
See Also
VoltageTypeSet Class
Autodesk.Revit.DB.Electrical Namespace